In [2]:
import pandas as pd

In [5]:
#Creacion de un dataframe a partir de un diccionario
data = {'nombre': ['Duber', 'Samuel', 'Carlos', 'Diana'],
        'profesion': ['Programador', 'Chef', 'Piloto', 'Doctora'],
        'edad': [20, 35, 28, 43]}
personas = pd.DataFrame(data)
personas

   nombre    profesion  edad
0   Duber  Programador    20
1  Samuel         Chef    35
2  Carlos       Piloto    28
3   Diana      Doctora    43

In [6]:
#Dataframe a partir de una lista
data = pd.DataFrame([['Andres', 40], ['David', 23], ['Maria', 32]], columns=['Nombre', 'Edad'])
data

   Nombre  Edad
0  Andres    40
1   David    23
2   Maria    32

In [8]:
import numpy as np

In [10]:
#Dataframe a partir de un array
data = pd.DataFrame(np.random.randn(4,3), columns=['A', 'B', 'C'])
data

          A         B         C
0 -0.898945  0.478435 -1.878915
1  0.749727  0.446189 -0.541432
2 -1.544038 -0.590437  0.400082
3 -0.943966 -1.669217  0.455154